{
  "name":"Cloud",
  "iconLocationPWA":"../public/assets/character/svgs/cloud.svg",
  "portraitLocationPWA":"../public/assets/character/portraits/cloud/chara_1_donkey_00.png",
  "iconLocation":"../assets/character/svgs/cloud.svg",
  "portraitLocation":"../assets/character/portraits/cloud/chara_1_donkey_00.png",
  "matchupInfo":{
    "keyNotes":[
      "Look out for his jump timings, and read his jumps with an aerial when the time's right",
      "Run under his full hops / double jumps and pivot grab him. His aerials are huge on one side but are a commitment",
      "Prioritize launching him offstage rather than upwards (e.g. prioritize CUT bair over Cut uair)",
      "Cat and Mouse vs limit",
      "Respect Cloud's OoS game"
    ],
    "generalConsensus":[
      {
        "type":"description",
        "content": "The most controversial DK matchup of all time... Some Clouds think they win. Some Clouds including Sparg0 think they lose. Some DKs think they win. Some DKs think they lose. Heck, in a prior DKcord community poll, the average of ~40 votes ended up in the DKs saying it was exactly even (literally 0.0), though it can be argued either way to go from +1 to -1."
      },
      {
        "type":"dkHas",
        "content":[
          "Grab. The controversy comes from how likely is it for DK to get this grab. If he does get it, he gets pDKO, walkoff CDT, imagination...",
          "Corner carries. Almost everything DK does pushes Cloud into the corner, which makes it very likely to gimp him.",
          "Ftilt 2-framing. Absolutely polarizing vs Cloud.",
          "Superarmor. Using it is generally considered a huge callout, especially gSK, but a well-timed one can completely change the momentum of the match. It also helps that everything he does minus Cross Slash is a single hit, so armoring his moves is relatively easy."
        ]
      },
      {
        "type":"enemyHas",
        "content":[
          "Bair. Counterplaying this requires a significant callout from DK.",
          "Shield pressure. Whether with Bair, Fair, or Cross Slash, Cloud can pressure DK's shield exceptionally well all while staying mobile and hard to catch.",
          "OOS. His upB is good enough to catch almost everything DK does on his shield, and it can even be done preemptively to stuff out perfect landing aerials before they hit his shield (especially vs aHS to negate the -4 shield safety)."
        ]
      }
    ],
    "stageSelection":[
      {
        "stageType":"pDKO Stages",
        "stageTypeExplanation":[
          "Grabbing swordies, not much to explain here"
        ]
      },
      {
        "stageType":"Flat Stages",
        "stageTypeExplanation":[
          "Cloud's juggles become worse on flat stages, as their aerials aren't designed to frame trap. They work better covering platforms as you land on them, whether with aerials, Utilt, or Usmash",
          "Their neutral becomes a lot more linear, making it easier to get parries and grabs",
          "We don't necessarily need pDKO when walkoff CDT works just fine, at even earlier percents too (unless if you get a grab at center)",
          "HOWEVER, it becomes a LOT harder to run away from Cloud with Limit"
        ]
      },
      {
        "stageType":"Triplats",
        "stageTypeExplanation":[
          "Cloud becomes a LOT stronger as he can catch landings onto platforms",
          "His platform pressure gets better with Bair / Cross Slash / Utilt / etc",
          "His mobility becomes insane as he can jump from platform to platform, zigzagging all over the place until he decides to swing with his big fat sword"
        ]
      }
    ],
    "howWeWin":[
      {
        "sectionName":"Bait & Punish",
        "sectionPoints":[
          "Cloud has big moves, and generally very little end lag. You want to bait him into doing laggier options such as rising aerials or Cross Slash whiffs",
          "This includes a lot of weaving in and out, whether doing walk forward + dash back, dash dancing, or taking the air",
          {
            "subSectionDesc":"If they're an Up B abuser, you can either bait that out or his shield. Former is usually preferred, since preemptive UpB before you hit his shield will beat out most options too.",
            "subSectionPoints":[
              "Nair is fast and safe enough to block upB OOS when autocancelled"
            ]
          },
          "One way of baiting him is, when he approaches you with a jump in aerial, you can often run under him and pivot grab"
        ]
      },
      {
        "sectionName":"Shielding + Parries",
        "sectionPoints":[

          "Cloud has a small and weak grab, making shield a strong option at close ranges",
          "This is *specifically* at close ranges, when you have no room to dodge in time. Otherwise you still want to prioritize movement and evading, rather than passively putting yourself into shield mixups",
          
            
            

          {
            "subSectionDesc":"You can also look for parries to actually punish his aerials",
            "subSectionPoints":[
              "You can generally react to Fair. Bair takes more of a read. This means noticing which direction he's facing is significant!",
              "Look out for Cross Slash multi-hit mixups"
            ]
          },

          {
            "subSectionDesc":"Parry Punishes",
            "subSectionPoints":[
              "Parry -> Dtilt is a true punish against all of Cloud's aerials",
              "You can parry -> walk -> shield for a chance of a bigger punish e.g. grab, especially since Cloud's __grounded options aren't safe at all__. This is useful if he's already past trip percent.",
              "🎞️ Example from Light (+ commentary from Ramses), who instead does a SHFF (thanks to Fox's fall speed) into shield: \n https://clips.twitch.tv/HumbleObedientBaguetteCoolCat-AthfLK3KJ_utrzse",
              "We're too floaty to do this kind of jump, but closing the space by walking just a few pixels is often good enough given how big DK's grab is"
            ]
          },
          {
            "subSectionDesc":"Spot Dodge",
            "subSectionPoints":[
              "can avoid both aerials and empty land grabs"
            ]
          }
        ]
      },
      {
        "sectionName":"Edgeguarding",
        "sectionPoints":[
          {
            "subSectionDesc":"Cargo Sticky Walk",
            "subSectionPoints":[
              "This can work, but it can also be really risky despite Cloud's recovery",
              "Cloud can jump to avoid aSK, or he can simply drift out",
              "In addition, he can do an Up B sacrificial kill through aSK"
            ]
          },
          {
            "subSectionDesc":"Offstage Up B Kills",
            "subSectionPoints":[
              "If he has the stock lead, or if you have the percent lead, he may to bring you down with him with UpB. Be sure not to overextend!"
            ]
          },
          {
            "subSectionDesc":"Cargo Down Throw",
            "subSectionPoints":[
              "Do whatever it takes to get that grab near ledge... Ftilt tech chases, Dtilt trips, etc. It's by far our biggest win condition"
            ]
          },
          {
            "subSectionDesc":"Stalls",
            "subSectionPoints":[
              "Watch out for both Blade Beam and Cross Slash, both giving him one stall per air time",
              "Cloud also has a wall jump"
            ]
          },
          {
            "subSectionDesc":"Challenging Limit",
            "subSectionPoints":[
              "Look out for Limit Blade Beam -> regular upB to ledge",
              "They'll typically want to air dodge to ledge to preserve this limit. Wait this out, *then* go for the 2-frame",
              "🎞️ Sample clip of spacing an edgeguard around limit upB by HIKARU: \n https://clips.twitch.tv/TenaciousHeartlessVelociraptorSSSsss-49rgi0VL0fJX4scm"
            ]
          }
        ]
      },
      {
        "sectionName":"Corner Carries",
        "sectionPoints":[
          "Given his recovery, prioritize moves launching him horizontally. Fortunately this is majority of DK's toolkit, but this also means considering combo routes like CUT Nair Bar over CUT Uair, or gHS Nair over Uair"
        ]
      },
      {
        "sectionName":"Intercept Jumps",
        "sectionPoints":[
          "Don't be afraid to meet him in the air and just Nair or Bair him. This typically requires a read on his jump timings, or just a reaction to his full hop / double jump if he isn't mixing up well",
          {
            "subSectionDesc": "If you do get caught by a rising aerial (or Dair from high above), this means two things:",
            "subSectionPoints":[
              "This is less punishing than a landing aerial",
              "He's reading YOUR jump, and he's willing to do preemptive aerials. If he does enough of these, you can simply wait for him to do one, then whiff punish"
            ]
          },
          {
            "subSectionDesc": "From Sparg0:",
            "subSectionPoints": [
              "Although risky and may not apply to slow characters, if you time it correctly you can catch cloud's landing fair by just running in the right time and punish with a grab or dash attack without needing to parry or shield"
            ]
          }
        ]
      },
      {
        "sectionName":"Camp Out Limit",
        "sectionPoints":[
          "His limit is on a 15 second timer, and you can often circle camp him enough to time it out",
          "While circle camping him, you still want to sprinkle in a bit of aggression here and there so you don't become too predictable",
          "This is especially important not just because of his specials, but because his mobility stats get buffed as well",
          "Watch out for Limit Blade Beam as he figures out your movement patterns",
          "His rising aerials are decent commitments. Not only does this make circle camping actually doable, but it also means you can often find gaps between his swings where you can drop through and hit him" 
        ]
      }
    ],
    "howWeLose":[
      {
        "sectionName":"Ledge Trapping",
        "sectionPoints":[
          {
            "subSectionDesc":"Hits Ledge Hang",
            "subSectionPoints":[
              "Dtilt (head lift only)",
              "Dash Attack (always)",
              "Dsmash (head lift only)",
              "Dair",
              "Blade Beam (head lift only)",
              "Limit Blade Beam (always)",
              "Limit Cross Slash (head lift only)"
            ]
          },

          "Because of all these, you do NOT want to hang on ledge for long, ESPECIALLY with how lethal Dash Attack is",
          "It's also important to get as many ledge iframes as possible (aka stall offstage as much as possible), so that you get more room for timing mixups when getting off.",
          {
            "subSectionDesc":"Bair Walling",
            "subSectionPoints":[
              "This is all a matter of timing mixups, predicting when he'll cover high, etc.",
              "Walk and shield goes a long way. You generally don't want to fight your way out, but instead just slowly take space one inch at a time",
              "Shield health is REALLY important to keep track here as well, otherwise a 3rd Bair is likely to shield poke. ",
              "You could go back to ledge (remember to stall a bit for iframes) for the sake of letting your shield recover",
              "Low shield health also makes them more likely to swing immediately... which can make parrying easier"
            ]
          }
        ]
      },
      {
        "sectionName":"Juggling",
        "sectionPoints":[
          "Uair lasts forever and beats out practically everything we do",
          "He's even stronger at catching landings: Dash Attack, Usmash, OOS, Limit Blade Beam",
          "If you don't wanna deal with this... you're going to deal with Cloud ledge trapping <:DKDead:441061084195979264>"
        ]
      },
      {
        "sectionName":"Edgeguarding",
        "sectionPoints":[
          {
            "subSectionDesc":"Cloud can actually go REALLY deep without limit. Full hop falling Bair covers a LOT of space, and if he misses, he can still cover himself with a double jump Bair while still making it back",
            "subSectionPoints":[
              "This doesn't work quite as well with Fair (and even worse Dair), since it's much more committal and has less range, making it a lot more telegraphed. Fortunately this is what your average Cloud is going for anyway because they want to spike Donkey Kong offstage",
              "Both rising and falling Bair can beat out aSK as well"
            ]
          },
          "Limit however is when you should be most concerned",
          "Limit Cross Slash cleanly beats out aSK with its iframes and disjoint",
          "Limit Blade Beam also beats out aSK, and depending on the stage can still kill really early",
          "Limit Climhazzard allows Cloud to go SUPER deep offstage, as if it looks like he were to go for a sacrifice kill"
        ]
      }
    ],
    "otherNotes":[
    ],
    "setsToStudy":[
      {
        "setDescription":"Rarikkusu vs Sparg0 Delta #8 May 2024",
        "setLink":"https://discord.com/channels/440714291423870977/871326847651155969/1062145121187008545",
        "setScore":"W/L: W, 2-0"
      }
    ],
    "extraResources":[
      {
        "resourceDescription":"example: Bair tumble percent",
        "resourcePoints":[
          {
            "nameThisHowever":"Short Hop",
            "howeversInfo":"30%"
          },
          {
            "nameThisHowever":"Full Hop",
            "howeversInfo":"27%"
          }
        ]
      },
      {
        "resourceDescription":"example: Dair through platform",
        "resourcePoints":[
          "example: True in: PS2/SBF/BF/SMV/HB"
        ]
      }
    ],
    "moves":{
      "grounded":[
  
      ],
      "aerials":[
  
      ],
      "specials":[
  
      ]
    }
  }
}