{
  "name":"Mario",
  "iconLocation":"../svgs/(char).svg",
  "portraitLocation":"../portraits/(char)/chara_1_donkey_00.png",
  "matchupInfo":{
    "keyNotes":[
      "Stop going to PS2",
      "Stay disciplined in keeping Mario out at ALL times, with non-committal moves",
      "Air camping prevents him from getting in with fireball and landing aerials",
      "Be very careful at poking his shield and his broken OOS game"
    ],
    "generalConsensus":[
      {
        "type":"description",
        "content": "Getting touched is devastating... keeping him out, it's not terrible, it could be worse. Most people would say between -1 and -2, in Mario's favor."
      },
      {
        "type":"dkHas",
        "content":[
          "Decent keepaway tools",
          "If DK manages not to get zero-to-deathed, he can live surprisingly long",
          "Weight difference"
        ]
      },
      {
        "type":"enemyHas",
        "content":[
          "Multiple approach options that can perfectly open up DK and his blind spots",
          "Touch of death everywhere lol",
          "Can completely mash on DK's shield more than most characters"
        ]
      }
    ],
    "stageSelection":[
      {
        "stageType":"Flat Stages",
        "stageTypeExplanation":[
          "Minimizes his combo game... by a LOT ",
          "He has weak landing options, which are weakened even further without having platforms to land on",
          "Please don't ban FD just because you don't feel comfortable on it... if Mario for some reason leaves it open, please go there"
        ]
      },
      {
        "stageType":"Pokemon Stadium 2",
        "stageTypeExplanation":[
          "'DK's best stage is PS2 so let's go there' 🚨 NO! 🚨 ",
          "The platforms allow Mario to extend from *anywhere* on stage",
          "The platform extension combined with PS2's low ceiling makes zero to deaths *very* common",
          "Don't do it, please, the pDKO isn't worth it"
        ]
      },
      {
        "stageType":"Triplats",
        "stageTypeExplanation":[
          "Uair ladders :)",
          "Circle camping can work pretty well against him here, but you can air camp him on most other stages (even FD) without him killing you off one catch",
          "On Yoshi's Story, he kills there EXTREMELY early, BUT so does DK, so playing fire with fire (or at least using a ban on this) may or may not be worthwhile, depending on how good your own advantage state is"
        ]
      }
    ],
    "howWeWin":[
      {
        "sectionName":"Keepaway",
        "sectionPoints":[
          "Non-committal walling is key",
          "Think Nair <:AutoCancelsEveryNonActiveFrame:953427707943866368>, Bair <:Yes:526307516301312010>, and Dtilt <:Dtilt:953427707490869268> ",
          {
            "subSectionDesc":"Even moves like Ftilt and gHS can be a bit too risky",
            "subSectionPoints":[
              "gHS can be decent if he's dashing in and out a lot, but jumps and fireballs can ruin it"
            ]
          }
        ]
      },
      {
        "sectionName":"Platform Camping",
        "sectionPoints":[
          "You can catch Mario better with stray aerials, as he tries to chase you down",
          "Minimize shielding on a platform, due to spammable Uairs and Dair safely eating up a decent amount of shield",
          "Find openings with fast fall Nairs, Bairs, and platform drop mixups (aerials, empty land into ground options, etc)",
          "Platforms help avoid landing aerial combo starters, grabs, and smash attacks for kills. Sounds good, doesn't it",
          "Watch out for high Dairs (say full hop above platform height) killing relatively early, think 120+"
        ]
      },
      {
        "sectionName":"Edgeguarding",
        "sectionPoints":[
          "2-frames are relatively easy if you know which upB angle they like to go for (either more horizontal or more vertical)",
          "Watch for Cape stalls",
          "Ledge drop Bair trades surprisingly well vs UpB"
        ]
      },
      {
        "sectionName":"Ledge Trapping",
        "sectionPoints":[
          "Don't be afraid to call out ledge jump Fireball, with a Bair ",
          "Watch out for ledge drop -> turnaround Cape -> Bair: Bait and whiff punish"
        ]
      },
      {
        "sectionName":"Juggles",
        "sectionPoints":[
          "Mario's floatiness (even floatier than DK) leaves him pretty vulnerable to DK's juggling",
          "Watch out for Fireball b-reverses (higher juggles are better, full hop height or higher)",
          "Watch for Cape stalls",
          {
            "subSectionDesc":"Do NOT catch landing aerials with gSK! ",
            "subSectionPoints":[
              "There's just so little landing lag on Mario's aerials that he can often shield in time, after gSK tanks the hit but before it actually hits him."
            ]
          }
        ]
      }
    ],
    "howWeLose":[
      {
        "sectionName":"CQC",
        "sectionPoints":[
          "Grabs and landing aerials = death",
          "Reset often, but also don't be afraid to call out overshoots as he tries to chase you down",
          "Note that every time you escape, the Mario is taking note of how you do so. Keep mixing it up at all times because a read on your escape can still mean death (e.g. dash grabbing your roll away)"
        ]
      },
      {
        "sectionName":"OoS Game",
        "sectionPoints":[
          "Mario's OOS game is amazing, with half a dozen options with single-digit startup",
          "UpB (f3) catches basically everything, but is the easiest to punish if baited + is unsafe on hit at low percents",
          "Nair (f6) is his next fastest option, with very low risk/reward, but any spaced move negates this",
          "Uair (f7) combo starter, even hits DK when standing",
          "Dair (f8) catching jumps well, crossing up and reversaling positions, more combos",
          "Bair (f9) hits far and low behind him, where it'd normally be a blind spot for most characters",
          "Usmash (f9) kill move",
          "You basically only have Dtilt, gHS, and Giant Punch to safely poke at his shield."
        ]
      },
      {
        "sectionName":"Shielding",
        "sectionPoints":[
          "Leaves you open to grabs, safe aerials, Fireball blockstrings... yeah. Don't do it.",
          "Even on platforms, Mario is great at pressuring your shield with Uairs and Dairs"
        ]
      },
      {
        "sectionName":"Ledge Trapping",
        "sectionPoints":[
          "You generally want to **ledge jump at high percents** to avoid his non-committal Smash attacks (especially Fsmash killing *early*) and Bthrow",
          "You still need to watch out for Bair / Dair callouts however, though it's often stronger to mix up **when you air dodge** after ledge jump, rather than getting conditioned into a ledge getup / roll"
        ]
      },
      {
        "sectionName":"Edgeguarding",
        "sectionPoints":[
          "Cape, Fair, ledge drop DJ Bair (especially with wall jumps to go deeper), wall jump Fair... yeah",
          "It's better, if possible, to take a little bit of extra damage and land on a platform, rather than dealing with these super tricky situations offstage"
        ]
      }
    ],
    "otherNotes":[

      "exploit marios lack of speed and range ",
      "when you start getting comboed just circle your stick cus if you cant read your DI then they cant either",
      "when playing defensively just slowly walk back and press a button, dont let mario catch you shielding",

      "Use our ranged moves to keep mario out",
      "Learn when to di away and when to di in vs Mario combos. ",
      "Mixup your recoveries to avoid getting caped",

      "Wall him out the best you can with bairs and tilts (NEVER let him get too close)",
      "avoid jumping too much or landing on his shield to often",
      "mix up your approach and recovery options",

      "commit as little as possible in neutral unless you’ve got a solid read based on conditioning (emphasis on safer tools like dtilt or nair/bair to wall as opposed to ftilt, gHS, aHS, etc)",
      "getting comboed is inevitable but recognize the percents and positions where you will actually just die from a fair combo ",
      "focus on maintaining advantage state, killing mario early is cool but he’s very mediocre at both landing and getting off ledge. you want to build damage, not explode him",

      "never pick battlefield",
      "never di up",
      "gimp kills",

      "ban battlefield",
      "do NOT mess with up air just retreating bair/ftilt if you have to",
      "dont get caped",

      "ban triplats",
      "keep him out with tilts/bair",
      "shield sucks, so use movement to avoid his landing aerials (or parry them)"
    ],
    "setsToStudy":[
      {
        "setDescription":"player1 vs player2 - Tournament - Date",
        "setLink":"youtube.link",
        "setScore":"W/L: W, 2-0"
      }
    ],
    "extraResources":[
      {
        "resourceDescription":"example: Bair tumble percent",
        "resourcePoints":[
          {
            "nameThisHowever":"Short Hop",
            "howeversInfo":"30%"
          },
          {
            "nameThisHowever":"Full Hop",
            "howeversInfo":"27%"
          }
        ]
      },
      {
        "resourceDescription":"example: Dair through platform",
        "resourcePoints":[
          "example: True in: PS2/SBF/BF/SMV/HB"
        ]
      }
    ],
    "moves":{
      "grounded":[
  
      ],
      "aerials":[
  
      ],
      "specials":[
  
      ]
    }
  }
}